backend/of_cases/default/0/T
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions  [0 0 0 1 0 0 0];
internalField   uniform 100;
boundaryField
{
    left   { type fixedValue; value uniform 100;  }
    right  { type fixedValue; value uniform 100; }
    top    { type zeroGradient; }
    bottom { type zeroGradient; }
    frontAndBack { type empty; }
}
