backend/of_cases/default/0/epsilon
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions  [0 2 -3 0 0 0 0];
internalField   uniform 0.000539;
boundaryField
{
    movingWall   { type epsilonWallFunction; value uniform 0.000539; }
    fixedWalls   { type epsilonWallFunction; value uniform 0.000539; }
    inlet        { type fixedValue;          value uniform 0.000539; }
    outlet       { type zeroGradient; }
    walls        { type epsilonWallFunction; value uniform 0.000539; }
    frontAndBack { type empty; }
}
