backend/of_cases/default/0/k
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions  [0 2 -2 0 0 0 0];
internalField   uniform 0.003750;
boundaryField
{
    movingWall   { type kqRWallFunction; value uniform 0.003750; }
    fixedWalls   { type kqRWallFunction; value uniform 0.003750; }
    inlet        { type fixedValue;       value uniform 0.003750; }
    outlet       { type zeroGradient; }
    walls        { type kqRWallFunction; value uniform 0.003750; }
    frontAndBack { type empty; }
}
